## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.terraform-google-billing-budget.google_billing_budget.budget[0] will be created
+   resource "google_billing_budget" "budget" {
+       billing_account = "015525-9D090C-CC8778"
+       display_name    = "global-alert"
+       id              = (known after apply)
+       name            = (known after apply)

+       amount {
+           specified_amount {
+               currency_code = "USD"
+               units         = "300"
            }
        }

+       budget_filter {
+           calendar_period        = (known after apply)
+           credit_types           = (known after apply)
+           credit_types_treatment = (known after apply)
+           labels                 = (known after apply)
+           projects               = (known after apply)
+           services               = (known after apply)
+           subaccounts            = (known after apply)

+           custom_period {
+               end_date {
+                   day   = (known after apply)
+                   month = (known after apply)
+                   year  = (known after apply)
                }

+               start_date {
+                   day   = (known after apply)
+                   month = (known after apply)
+                   year  = (known after apply)
                }
            }
        }

+       threshold_rules {
+           spend_basis       = "CURRENT_SPEND"
+           threshold_percent = 1
        }
+       threshold_rules {
+           spend_basis       = "CURRENT_SPEND"
+           threshold_percent = 0.5
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   project = "terrateam-362405"

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
